## Python for Data Analysis, 2nd ed

### 5 Getting started with pandas

#### 5.1 Introduction to pandas data structures

In [140]:
import pandas as pd

from pandas import Series, DataFrame

In [141]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [142]:
frame.describe()

            pop         year
count  6.000000     6.000000
mean   2.550000  2001.500000
std    0.836062     1.048809
min    1.500000  2000.000000
25%    1.875000  2001.000000
50%    2.650000  2001.500000
75%    3.125000  2002.000000
max    3.600000  2003.000000

In [143]:
frame.set_index('state')

        pop  year
state
Ohio    1.5  2000
Ohio    1.7  2001
Ohio    3.6  2002
Nevada  2.4  2001
Nevada  2.9  2002
Nevada  3.2  2003

In [144]:
frame.transpose()

          0     1     2       3       4       5
pop     1.5   1.7   3.6     2.4     2.9     3.2
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003

In [145]:
frame.truncate(1,4)

   pop   state  year
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [146]:
frame.head()  # Return first 5 rows

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [147]:
# passing the 'columns' argument will show the columns in that order, and ad NaN to any columns without values
# unspecified columns will not be shown
frame2 = pd.DataFrame(data, columns=['state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

frame2

        state  pop debt
one      Ohio  1.5  NaN
two      Ohio  1.7  NaN
three    Ohio  3.6  NaN
four   Nevada  2.4  NaN
five   Nevada  2.9  NaN
six    Nevada  3.2  NaN

In [148]:
# Retrieving columns: Dict-like notation / By attribute
print frame2['state']
print '--------------------------'
print frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
--------------------------
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [149]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['three']

state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [150]:
# Columns can be assigned a scalar
frame2['debt'] = 16.5
print frame2

print '--------------------------'

# Or a list/array of values. In this case, the list's length must match the DataFrame's length
frame2.debt = [15.2, 12.4, 24.2, 12.4, 24.1, 24.4]
print frame2

print '--------------------------'

# Or a Series, in which case the labels will be realigned accordingly
val = pd.Series([-1.0, -2.2, -5], index=['one', 'two', 'five'])
frame2.debt = val
print frame2

        state  pop  debt
one      Ohio  1.5  16.5
two      Ohio  1.7  16.5
three    Ohio  3.6  16.5
four   Nevada  2.4  16.5
five   Nevada  2.9  16.5
six    Nevada  3.2  16.5
--------------------------
        state  pop  debt
one      Ohio  1.5  15.2
two      Ohio  1.7  12.4
three    Ohio  3.6  24.2
four   Nevada  2.4  12.4
five   Nevada  2.9  24.1
six    Nevada  3.2  24.4
--------------------------
        state  pop  debt
one      Ohio  1.5  -1.0
two      Ohio  1.7  -2.2
three    Ohio  3.6   NaN
four   Nevada  2.4   NaN
five   Nevada  2.9  -5.0
six    Nevada  3.2   NaN

In [151]:
# Assigning a column will create a new one if it doesn't already exist
frame2['eastern'] = frame2.state == 'Ohio'
frame2

        state  pop  debt  eastern
one      Ohio  1.5  -1.0     True
two      Ohio  1.7  -2.2     True
three    Ohio  3.6   NaN     True
four   Nevada  2.4   NaN    False
five   Nevada  2.9  -5.0    False
six    Nevada  3.2   NaN    False

In [152]:
# Deleting columns
del frame2['eastern']
frame2.columns

Index([u'state', u'pop', u'debt'], dtype='object')

In [153]:
# Passing a dict of dicts to DataFrame. Outer keys- columns, Inner keys- rows
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
print frame3
print '--------------------------'
print frame3.T
print '--------------------------'
print frame3.transpose()

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
--------------------------
        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6
--------------------------
        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [154]:
frame3.index.name = 'Year'
frame3.columns.name = 'State'
frame3

State  Nevada  Ohio
Year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [155]:
print frame3.index.is_monotonic

True